Makro/Pruebas/Prueba 7.txt

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:tem="http://tempuri.org/">
   <soapenv:Header/>
   <soapenv:Body>
      <tem:OnlineGeneration>
         <!--Optional:-->
         <tem:ruc>900059238</tem:ruc>
         <!--Optional:-->
         <tem:Login/>
         <!--Optional:-->
         <tem:clave>88833C6E-AD43-4E7D-9A9F-132199692827</tem:clave>
         <!--Optional:-->
         <tem:docTxt>EN|01|F|SETT|15|2022-02-08|13:00:00|COP||1|31|900059238|MAKRO|MAKRO SUPERMAYORISTA S.A.S|23001|||MONTERIA|23||Cra.  14  No.  48 A 42 |CO|48|2|13|78752325|CARLOS HARVEY CUADRO CUADRADO|CARLOS HARVEY CUADRO CUADRADO||||||MONTERIA|CL 29 21 2 42|CO|49|150478.20|74775.20|160154.00|0.00|0.00|0.00|160154.00
ENEX|UBL 2.1|10|||||||2022-02-08||13:00:00||4690;4649;4711;4731|es|es|5|23001|MONTERIA|CORDOBA|23|Cra.  14  No.  48 A 42 |CO|Colombia||13|||23001|MONTERIA|CORDOBA|23|CL 29 21 2 42|CO|Colombia||13|6|16FD|01552666|23|Colombia|23001|CORDOBA|Colombia|23|111711|111711
RS|2022-02-17|2028-02-17|SETT|1|1000000||1702202246542
DE|1|371592|BG|1.00|3900.00|3900.00||0.00||false
DEDI|SAL REFISAL ALTA PUREZA 3000g
DEDI|3900.00
DEDIEX||999|1|||
DE|2|8424|PA|2.00|36500.00|71803.00||0.00||false
DEDI|ARROZ DIANA 500gX25u
DEDI|71803.00
DEDIEX||999|1|||
DEDR|false|1197.00|1.64|||73000.00
DE|3|123174|PA|2.00|13529.41|27058.82||0.00||false
DEDI|*JAB BRR REXONA ANTBACTFR 120gX7u
DEDI|32200.00
DEDIEX||999|1|||
DEIM|5141.18|27058.82|5141.18|19.00|01|IVA||PA|2570.59
DE|4|106575|C62|4.00|7983.19|23866.38||0.00||false
DEDI|CREMADENT COLGATE TRIACC 150ml
DEDI|28401.00
DEDIEX||999|1|||
DEIM|4534.61|23866.38|4534.61|19.00|01|IVA||C62|1133.65
DEDR|false|8066.39|25.26|||31932.77
DE|5|127632|PA|1.00|19600.00|19600.00||0.00||false
DEDI|TOAL.BNCH.INVI.RAP 10 TOALLASX2u
DEDI|19600.00
DEDIEX||999|1|||
DEIM|0.00|19600.00|0.00|0.00|01|IVA||PA|0.00
DE|6|126653|C62|10.00|500.00|4250.00||0.00||false
DEDI|PAN ROLLO ARO 53g
DEDI|4250.00
DEDIEX||999|1|||
DEIM|0.00|4250.00|0.00|0.00|01|IVA||C62|0.00
DEDR|false|750.00|15.00|||5000.00
DIT|9675.39
DI||23850.00|0.00|0.00|01|0.00|IVA||
DI||50925.61|9675.39|19.00|01|9675.39|IVA||
FP|1|10|2022-02-08|2216017569071
PE|Plantilla|T01_MBS.jasper
PE|CodigoBarras|220390351302010770096
PE|PPLTienda|ST16
PE|PPLCaja|1
PE|prom|0
PE|zona|N/A
PE|idInterno|1 2022039035
PE|CentroDistribucion|MAKRO MONTERIA
PE|DirCentroDistribucion|Cra.  14  No.  48 A 42 
PE|TelCentroDistribucion|N/A
PE|CorreoDist|
PE|PasaporteCliente|16-148173
PE|BarrioCliente|MONTERIA
PE|TelefonoCliente|N/A
PE|vrPuntosCMR|0.00
PE|vrEfectivo|170154.00
PE|vrTdebito|0.00
PE|vrCheque|0.00
PE|vrChequePost|0.00
PE|vrBonos|0.00
PE|vrTcredito|0.00
PE|vrTprivada|0.00
PE|vrNotaCredito|0.00
PE|vrCreditoDirecto|0.00
PE|vrDonacion|0.00
PE|vrCambio|-10000.00
PE|Caja|1 77
PE|TotalArticulos|20
PE|TextoFecha|08-02-2022     13:02     1601 2022039035
PES|CentroDist
PESD|1|MAKRO MONTERIA
PESD|2|Cra.  14  No.  48 A 42 
PES|ResolucionesFactura
PESD|1|AGENTE RETENEDOR IVA RES.00812 30/1/2006
PESD|2|REG.COMUN GRAN CONTRIB Res.9061 Dic/2020
PESD|3|AUTORETENEDORES DEL IMPUESTO DE RENTA SEGUN RESOL No 1524 DE FEB 20 DE 2006
PES|Regimen
PESD|1|REG.COMUN GRAN CONTRIB Res.9061 Dic/2020
PESD|2| AUTORETENEDORES DEL IMPUESTO DE RENTA  
PESD|3| SEGUN RESOL No 1524 DE FEB 20 DE 2006  
PESD|4|        AGENTE RETENEDOR DE IVA         
PESD|5|      RESOLUCION 00812 30/01/2006       
PESD|6|
PESD|7|
PESD|8|
PES|CambioMercancia
PESD|1|(*)BIENES EXENTOS - DECRETO 417 DE 2020       CAMBIOS DENTRO DE LOS 7 DIAS HABILES A   PARTIR DE LA COMPRA,PRESENTA LA FACTURA 
PES|Falabella
PESD|1|Gracias por tu visita
PESD|2|
PESD|3|
CTE||||dte_9000592385@dte.paperless.com.co|
CTR|||||
TRE|O-13;O-15|IVA|01
TRR|R-99-PN|IVA|01</tem:docTxt>
         <!--Optional:-->
         <tem:tipoFoliacion>1</tem:tipoFoliacion>
         <!--Optional:-->
         <tem:tipoRetorno>5</tem:tipoRetorno>
      </tem:OnlineGeneration>
   </soapenv:Body>
</soapenv:Envelope>